proddy/EMS-ESP32/src/core/analogsensor.cpp
/*
 * EMS-ESP - https://github.com/emsesp/EMS-ESP
 * Copyright 2020  Paul Derbyshire
 * 
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "analogsensor.h"
#include "emsesp.h"

#include <utility> // for std::exchange

namespace emsesp {

uuid::log::Logger AnalogSensor::logger_{F_(analogsensor), uuid::log::Facility::DAEMON};

#ifndef EMSESP_STANDALONE
portMUX_TYPE  mux                     = portMUX_INITIALIZER_UNLOCKED;
unsigned long AnalogSensor::edge[]    = {0, 0, 0};
unsigned long AnalogSensor::edgecnt[] = {0, 0, 0};

void IRAM_ATTR AnalogSensor::freqIrq0() {
    portENTER_CRITICAL_ISR(&mux);
    edgecnt[0]++;
    edge[0] = micros();
    portEXIT_CRITICAL_ISR(&mux);
}
void IRAM_ATTR AnalogSensor::freqIrq1() {
    portENTER_CRITICAL_ISR(&mux);
    edgecnt[1]++;
    edge[1] = micros();
    portEXIT_CRITICAL_ISR(&mux);
}
void IRAM_ATTR AnalogSensor::freqIrq2() {
    portENTER_CRITICAL_ISR(&mux);
    edgecnt[2]++;
    edge[2] = micros();
    portEXIT_CRITICAL_ISR(&mux);
}
#endif

void AnalogSensor::start(const bool factory_settings) {
    // if (factory_settings && EMSESP::nvs_.getString("boot").equals("E32V2_2") && EMSESP::nvs_.getString("hwrevision").equals("3.0")) {
    if (factory_settings && analogReadMilliVolts(39) > 700) { // core voltage > 2.6V
        EMSESP::webCustomizationService.update([&](WebCustomization & settings) {
            auto newSensor   = AnalogCustomization();
            newSensor.gpio   = 39;
            newSensor.name   = "core_voltage";
            newSensor.offset = 0;
            newSensor.factor = 0.00377136; // Divider 24k - 8,66k
            newSensor.uom    = DeviceValueUOM::VOLTS;
            newSensor.type   = AnalogType::ADC;
            settings.analogCustomizations.push_back(newSensor);
            newSensor.gpio   = 36;
            newSensor.name   = "supply_voltage";
            newSensor.factor = 0.017; // Divider 24k - 1,5k
            settings.analogCustomizations.push_back(newSensor);
            return StateUpdateResult::CHANGED; // persist the change
        });
    }
    reload(true); // fetch the list of sensors from our customization service

    if (!analog_enabled_) {
        return;
    }

    analogSetAttenuation(ADC_11db); // for all channels 3.3V

    LOG_INFO("Starting Analog Sensor service");

    // Add API calls
    Command::add(
        EMSdevice::DeviceType::ANALOGSENSOR,
        F_(setvalue),
        [&](const char * value, const int8_t id) { return command_setvalue(value, id); },
        FL_(setiovalue_cmd),
        CommandFlag::ADMIN_ONLY);

    char topic[Mqtt::MQTT_TOPIC_MAX_SIZE];
    snprintf(topic, sizeof(topic), "%s/#", F_(analogsensor));
    Mqtt::subscribe(EMSdevice::DeviceType::ANALOGSENSOR, topic, nullptr); // use empty function callback
}

// load settings from the customization file, sorts them and initializes the GPIOs
void AnalogSensor::reload(bool get_nvs) {
    EMSESP::webSettingsService.read([&](WebSettings & settings) { analog_enabled_ = settings.analog_enabled; });

#if defined(EMSESP_STANDALONE)
    analog_enabled_ = true; // for local offline testing
#endif
    for (auto sensor : sensors_) {
        remove_ha_topic(sensor.type(), sensor.gpio());
        sensor.ha_registered = false;
    }

    if (!analog_enabled_) {
        sensors_.clear();
        return;
    }
    changed_ = true;
    // load the list of analog sensors from the customization service
    // and store them locally and then activate them
    EMSESP::webCustomizationService.read([&](WebCustomization & settings) {
        // Create temporary vector for new sensor list
        std::vector<Sensor> new_sensors;
        new_sensors.reserve(settings.analogCustomizations.size());

        // Process all custom sensors in a single pass
        for (const auto & sensor : settings.analogCustomizations) {
            // Look for existing sensor with same GPIO
            auto existing = std::find_if(sensors_.begin(), sensors_.end(), [&sensor](const Sensor & s) { return s.gpio() == sensor.gpio; });

            if (existing != sensors_.end()) {
                // Update existing sensor
                if (sensor.type >= AnalogType::DIGITAL_OUT && sensor.type <= AnalogType::PWM_2
                    && (existing->type() != sensor.type || existing->offset() != sensor.offset || existing->factor() != sensor.factor)) {
                    existing->set_value(sensor.offset);
                }
                if (sensor.type == AnalogType::COUNTER && existing->offset() != sensor.offset
                    && sensor.offset != EMSESP::nvs_.getDouble(sensor.name.c_str(), 0)) {
                    EMSESP::nvs_.putDouble(sensor.name.c_str(), sensor.offset);
                    existing->set_value(sensor.offset);
                }
                existing->set_name(sensor.name);
                existing->set_type(sensor.type);
                existing->set_offset(sensor.offset);
                existing->set_factor(sensor.factor);
                existing->set_uom(sensor.uom);
                existing->ha_registered = false;
                new_sensors.push_back(std::move(*existing));
            } else {
                // Add new sensor
                new_sensors.emplace_back(sensor.gpio, sensor.name, sensor.offset, sensor.factor, sensor.uom, sensor.type);
                new_sensors.back().ha_registered = false;
                if (sensor.type == AnalogType::COUNTER || sensor.type >= AnalogType::DIGITAL_OUT) {
                    new_sensors.back().set_value(sensor.offset);
                } else {
                    new_sensors.back().set_value(0);
                }
            }

