proddy/EMS-ESP32/src/core/analogsensor.cpp
            // Register commands for writable sensor types
            if (sensor.type == AnalogType::COUNTER || (sensor.type >= AnalogType::DIGITAL_OUT && sensor.type <= AnalogType::PWM_2)
                || sensor.type == AnalogType::RGB || sensor.type == AnalogType::PULSE) {
                Command::add(
                    EMSdevice::DeviceType::ANALOGSENSOR,
                    sensor.name.c_str(),
                    [&, gpio = sensor.gpio](const char * value, const int8_t id) { return command_setvalue(value, gpio); },
                    sensor.type == AnalogType::COUNTER       ? FL_(counter)
                    : sensor.type == AnalogType::DIGITAL_OUT ? FL_(digital_out)
                    : sensor.type == AnalogType::RGB         ? FL_(RGB)
                    : sensor.type == AnalogType::PULSE       ? FL_(pulse)
                                                             : FL_(pwm),
                    CommandFlag::ADMIN_ONLY);
            }
        }

        // Replace old sensors with new optimized list
        sensors_ = std::move(new_sensors);
        return true;
    });

    // sort the list based on GPIO (id)
    // std::sort(sensors_.begin(), sensors_.end(), [](const Sensor & a, const Sensor & b) { return a.id() < b.id(); });

    // activate each sensor
    for (auto & sensor : sensors_) {
        sensor.ha_registered = false; // force HA configs to be re-created

        // first check if the GPIO is valid. If not, force set it to disabled
        if (!System::is_valid_gpio(sensor.gpio())) {
            LOG_WARNING("Bad GPIO %d for Sensor %s. Disabling.", sensor.gpio(), sensor.name().c_str());
            sensor.set_type(AnalogType::NOTUSED); // set disabled
            continue;                             // skip this loop pass
        }

        if ((sensor.gpio() == 25 || sensor.gpio() == 26)
            && (sensor.type() == AnalogType::COUNTER || sensor.type() == AnalogType::DIGITAL_IN || sensor.type() == AnalogType::RATE
                || sensor.type() == AnalogType::TIMER)) {
            // pullup is mapped to DAC, so set to 3.3V
#if CONFIG_IDF_TARGET_ESP32
            if (sensor.gpio() == 25 || sensor.gpio() == 26) {
                dacWrite(sensor.gpio(), 255);
            }
#elif CONFIG_IDF_TARGET_ESP32S2
            if (sensor.gpio() == 17 || sensor.gpio() == 18) {
                dacWrite(sensor.gpio(), 255);
            }
#endif
        }
        if (sensor.type() == AnalogType::ADC) {
            LOG_DEBUG("ADC Sensor on GPIO %02d", sensor.gpio());
            // analogSetPinAttenuation does not work with analogReadMilliVolts
            sensor.analog_       = 0; // initialize
            sensor.last_reading_ = 0;
        } else if (sensor.type() == AnalogType::NTC) {
            LOG_DEBUG("NTC Sensor on GPIO %02d", sensor.gpio());
            // analogSetPinAttenuation(sensor.gpio(), ADC_11db); //does not work with analogReadMilliVolts
            sensor.set_uom(DeviceValueUOM::DEGREES);
        } else if (sensor.type() == AnalogType::COUNTER) {
            LOG_DEBUG("I/O Counter on GPIO %02d", sensor.gpio());
            pinMode(sensor.gpio(), INPUT_PULLUP);
            sensor.polltime_ = 0;
            sensor.poll_     = digitalRead(sensor.gpio());
            if (double_t val = EMSESP::nvs_.getDouble(sensor.name().c_str(), 0)) {
                sensor.set_value(val);
            }
            publish_sensor(sensor);
        } else if (sensor.type() == AnalogType::TIMER || sensor.type() == AnalogType::RATE) {
            LOG_DEBUG("Timer/Rate on GPIO %02d", sensor.gpio());
            pinMode(sensor.gpio(), INPUT_PULLUP);
            sensor.polltime_      = uuid::get_uptime();
            sensor.last_polltime_ = uuid::get_uptime();
            sensor.poll_          = digitalRead(sensor.gpio());
            sensor.set_offset(0);
            sensor.set_value(0);
            publish_sensor(sensor);
#ifndef EMSESP_STANDALONE
        } else if (sensor.type() >= AnalogType::FREQ_0 && sensor.type() <= AnalogType::FREQ_2) {
            LOG_DEBUG("Frequency on GPIO %02d", sensor.gpio());
            pinMode(sensor.gpio(), INPUT_PULLUP);
            sensor.set_offset(0);
            sensor.set_value(0);
            publish_sensor(sensor);
            auto index = sensor.type() - AnalogType::FREQ_0;
            attachInterrupt(sensor.gpio(), index == 0 ? freqIrq0 : index == 1 ? freqIrq1 : freqIrq2, FALLING);
            lastedge[index] = edge[index] = micros();
            edgecnt[index]                = 0;
#endif
        } else if (sensor.type() == AnalogType::DIGITAL_IN) {
            LOG_DEBUG("Digital Read on GPIO %02d", sensor.gpio());
            pinMode(sensor.gpio(), INPUT_PULLUP);
            sensor.set_value(digitalRead(sensor.gpio())); // initial value
            sensor.set_uom(0);                            // no uom, just for safe measures
            sensor.polltime_ = 0;
            sensor.poll_     = digitalRead(sensor.gpio());
            publish_sensor(sensor);
        } else if (sensor.type() == AnalogType::RGB) {
            LOG_DEBUG("RGB on GPIO %02d", sensor.gpio());
            uint32_t v = sensor.value();
            uint8_t  r = v / 10000;
            uint8_t  g = (v - r * 10000) / 100;
            uint8_t  b = v % 100;
#if ESP_ARDUINO_VERSION_MAJOR < 3
            neopixelWrite(sensor.gpio(), 2 * r, 2 * g, 2 * b);
#else
            rgbLedWrite(sensor.gpio(), 2 * r, 2 * g, 2 * b);
#endif
            LOG_DEBUG("RGB set to %d, %d, %d", r, g, b);
        } else if (sensor.type() == AnalogType::DIGITAL_OUT) {
            LOG_DEBUG("Digital Write on GPIO %02d", sensor.gpio());
            pinMode(sensor.gpio(), OUTPUT);
#if CONFIG_IDF_TARGET_ESP32
            if (sensor.gpio() == 25 || sensor.gpio() == 26) {
                if (sensor.offset() > 255) {
                    sensor.set_offset(255);
                } else if (sensor.offset() < 0) {
                    sensor.set_offset(0);
                }
                dacWrite(sensor.gpio(), sensor.offset());
                sensor.set_value(sensor.offset());
            } else
#elif CONFIG_IDF_TARGET_ESP32S2
            if (sensor.gpio() == 17 || sensor.gpio() == 18) {
                if (sensor.offset() > 255) {
                    sensor.set_offset(255);
                } else if (sensor.offset() < 0) {
                    sensor.set_offset(0);
                }
                dacWrite(sensor.gpio(), sensor.offset());
                sensor.set_value(sensor.offset());
            } else
#endif
            {
                if (sensor.uom() == 0) { // set state from NVS
                    if (!get_nvs || EMSESP::nvs_.getChar(sensor.name().c_str(), -1) == -1) {
                        EMSESP::nvs_.putChar(sensor.name().c_str(), (int8_t)sensor.offset());
                    } else {
                        sensor.set_offset(EMSESP::nvs_.getChar(sensor.name().c_str()));
                    }
                }
                digitalWrite(sensor.gpio(), (sensor.offset() == 0) ^ (sensor.factor() > 0));
                sensor.set_value(sensor.offset());
            }
            publish_sensor(sensor);
        } else if (sensor.type() == AnalogType::PULSE) {
            LOG_DEBUG("Pulse on GPIO %02d", sensor.gpio());
            pinMode(sensor.gpio(), OUTPUT);
            digitalWrite(sensor.gpio(), (sensor.offset() == 1) ^ (sensor.value() == 1));
            sensor.polltime_ = sensor.value() != 0 ? uuid::get_uptime() + (sensor.factor() * 1000) : 0;
        } else if (sensor.type() >= AnalogType::PWM_0 && sensor.type() <= AnalogType::PWM_2) {
            LOG_DEBUG("PWM output on GPIO %02d", sensor.gpio());
#if ESP_IDF_VERSION_MAJOR >= 5
            ledcAttach(sensor.gpio(), sensor.factor(), 13);
#else
            uint8_t channel = sensor.type() - AnalogType::PWM_0;
            ledcSetup(channel, sensor.factor(), 13);
            ledcAttachPin(sensor.gpio(), channel);
#endif
            if (sensor.offset() > 100) {
                sensor.set_offset(100);
            } else if (sensor.offset() < 0) {
                sensor.set_offset(0);
            }
#if ESP_IDF_VERSION_MAJOR >= 5
            ledcWrite(sensor.gpio(), (uint32_t)(sensor.offset() * 8191 / 100));
#else
            ledcWrite(channel, (uint32_t)(sensor.offset() * 8191 / 100));
#endif
            sensor.set_value(sensor.offset());
            sensor.set_uom(DeviceValueUOM::PERCENT);
            publish_sensor(sensor);
        }
    }
}

// measure input sensors and moving average adc
void AnalogSensor::measure() {
    static uint32_t measure_last_ = uuid::get_uptime() - MEASURE_ANALOG_INTERVAL;
    const uint32_t  current_time  = uuid::get_uptime();

    // measure interval 500ms for adc sensors
    const bool should_measure_adc = (current_time - measure_last_) >= MEASURE_ANALOG_INTERVAL;
    if (should_measure_adc) {
        measure_last_ = current_time;
    }

    // Single pass through all sensors - process both ADC and digital sensors
    for (auto & sensor : sensors_) {
        const auto sensor_type = sensor.type();
        auto       old_value   = sensor.value(); // remember current value before reading

        // ADC sensors - measured every 500ms
        if (should_measure_adc) {
            if (sensor_type == AnalogType::ADC) {
                const uint16_t a = analogReadMilliVolts(sensor.gpio());
                if (!sensor.analog_) { // init first time
                    sensor.analog_ = a;
                    sensor.sum_    = a * 512;
                } else { // simple moving average filter
                    sensor.sum_    = (sensor.sum_ * 511) / 512 + a;
                    sensor.analog_ = sensor.sum_ / 512;
                }

                // detect change with little hysteresis on raw mV value
                if (sensor.last_reading_ + 1 < sensor.analog_ || sensor.last_reading_ > sensor.analog_ + 1) {
                    sensor.set_value(((int32_t)sensor.analog_ - sensor.offset()) * sensor.factor());
                    sensor.last_reading_ = sensor.analog_;
                    sensorreads_++;
                    changed_ = true;
                    publish_sensor(sensor);
                }
            } else if (sensor_type == AnalogType::NTC) {
                const uint16_t a = analogReadMilliVolts(sensor.gpio());
                if (!sensor.analog_) { // init first time
                    sensor.analog_ = a;
                    sensor.sum_    = a * 16;
                } else { // simple moving average filter
                    sensor.sum_    = (sensor.sum_ * 15 + a * 16) / 16;
                    sensor.analog_ = sensor.sum_ / 16;
                }
                if (sensor.analog_ > 0 && sensor.analog_ < 3300 && (sensor.last_reading_ + 1 < sensor.analog_ || sensor.last_reading_ > sensor.analog_ + 1)) {
                    sensor.set_value(sensor.offset() + 1 / (1 / T25 + log((double)sensor.analog_ / (3300 - sensor.analog_) * (Rt / R0)) / Beta) - T0);
                    sensor.last_reading_ = sensor.analog_;
                    sensorreads_++;
                    changed_ = true;
                    publish_sensor(sensor);
                }
#ifndef EMSESP_STANDALONE
            } else if (sensor_type >= AnalogType::FREQ_0 && sensor_type <= AnalogType::FREQ_2) {
                const auto index = sensor_type - AnalogType::FREQ_0;
                if (edge[index] != lastedge[index] && edgecnt[index] > 0) {
                    portENTER_CRITICAL_ISR(&mux);
                    const auto t    = (edge[index] - lastedge[index]) / edgecnt[index];
                    lastedge[index] = edge[index];
                    edgecnt[index]  = 0;
                    portEXIT_CRITICAL_ISR(&mux);
                    sensor.set_value(sensor.factor() * 1000000.0 / t);
                } else if (micros() - edge[index] > 10000000ul && sensor.value() > 0) {
                    sensor.set_value(0);
                }
                if (old_value != sensor.value()) {
                    changed_ = true;
                    publish_sensor(sensor);
                    old_value = sensor.value(); // Update for later comparison
                }
#endif
            }
        }

        // Digital I/O sensors - polled every time with debounce
        if (sensor_type == AnalogType::DIGITAL_IN || sensor_type == AnalogType::COUNTER || sensor_type == AnalogType::TIMER
            || sensor_type == AnalogType::RATE) {
            const auto current_reading = digitalRead(sensor.gpio());
            if (sensor.poll_ != current_reading) {     // check for pinchange
                sensor.polltime_ = current_time; // remember time of pinchange
                sensor.poll_     = current_reading;
            }
            // debounce and check for real pinchange
            if (current_time - sensor.polltime_ >= 15 && sensor.poll_ != sensor.last_reading_) {
                sensor.last_reading_ = sensor.poll_;
                if (sensor_type == AnalogType::DIGITAL_IN) {
                    sensor.set_value(sensor.poll_);
                } else if (!sensor.poll_) { // falling edge
                    if (sensor_type == AnalogType::COUNTER) {
                        sensor.set_value(old_value + sensor.factor());
                    } else if (sensor_type == AnalogType::RATE) { // default uom: Hz (1/sec) with factor 1
                        sensor.set_value(sensor.factor() * 1000 / (sensor.polltime_ - sensor.last_polltime_));
                    } else if (sensor_type == AnalogType::TIMER) { // default seconds with factor 1
                        sensor.set_value(sensor.factor() * (sensor.polltime_ - sensor.last_polltime_) / 1000);
                    }
                    sensor.last_polltime_ = sensor.polltime_;
                }
            }
        } else if (sensor_type == AnalogType::PULSE && sensor.value() && sensor.polltime_ && sensor.polltime_ < current_time) {
            sensor.set_value(0);
            digitalWrite(sensor.gpio(), sensor.offset());
            sensor.polltime_ = 0;
        }

