proddy/EMS-ESP32/src/core/analogsensor.cpp
        // Check for changes and publish (only if value actually changed)
        if (old_value != sensor.value()) {
            sensorreads_++;
            changed_ = true;
            publish_sensor(sensor);
        }
    }

    // store counter-values only every hour to reduce flash wear
    static uint8_t lastSaveHour = 0;
    time_t         now          = time(nullptr);
    tm *           tm_          = localtime(&now);
    if (tm_->tm_hour != lastSaveHour) {
        lastSaveHour = tm_->tm_hour;
        store_counters();
    }
}

// store counters to NVS, called every hour, on restart and update
void AnalogSensor::store_counters() {
    for (const auto & sensor : sensors_) {
        if (sensor.type() == AnalogType::COUNTER) {
            const double current_value = sensor.value();
            const double stored_value  = EMSESP::nvs_.getDouble(sensor.name().c_str(), -1.0);
            if (current_value != stored_value) {
                EMSESP::nvs_.putDouble(sensor.name().c_str(), current_value);
            }
        }
    }
}

void AnalogSensor::loop() {
    if (!analog_enabled_) {
        return;
    }

    measure(); // take the measurements
}

// update analog information name and offset
// a type value of -1 is used to delete the sensor
bool AnalogSensor::update(uint8_t gpio, std::string & name, double offset, double factor, uint8_t uom, int8_t type, bool deleted) {
    // first see if we can find the sensor in our customization list
    bool found_sensor = false;
    EMSESP::webCustomizationService.update([&](WebCustomization & settings) {
        for (auto & AnalogCustomization : settings.analogCustomizations) {
            if (AnalogCustomization.type == AnalogType::COUNTER
                || (AnalogCustomization.type >= AnalogType::DIGITAL_OUT && AnalogCustomization.type <= AnalogType::PWM_2)
                || AnalogCustomization.type >= AnalogType::RGB) {
                Command::erase_command(EMSdevice::DeviceType::ANALOGSENSOR, AnalogCustomization.name.c_str());
            }
            if (name.empty()) {
                char n[20];
                snprintf(n, sizeof(n), "%s_%02d", FL_(list_sensortype)[type], gpio);
                name = n;
            }
            if (AnalogCustomization.gpio == gpio) {
                found_sensor = true; // found the record
                // see if it's marked for deletion
                if (deleted) {
                    EMSESP::nvs_.remove(AnalogCustomization.name.c_str());
                    LOG_DEBUG("Removing analog sensor GPIO %02d", gpio);
                    settings.analogCustomizations.remove(AnalogCustomization);
                } else {
                    // update existing record
                    if (name != AnalogCustomization.name) {
                        EMSESP::nvs_.remove(AnalogCustomization.name.c_str());
                    }
                    AnalogCustomization.name   = name;
                    AnalogCustomization.offset = offset;
                    AnalogCustomization.factor = factor;
                    AnalogCustomization.uom    = uom;
                    AnalogCustomization.type   = type;
                    LOG_DEBUG("Customizing existing analog GPIO %02d", gpio);
                }
                return StateUpdateResult::CHANGED; // persist the change
            }
        }
        return StateUpdateResult::UNCHANGED;
    });

    // if the sensor exists and we're using HA, delete the old HA record
    if (found_sensor && Mqtt::ha_enabled()) {
        remove_ha_topic(type, gpio); // the GPIO
    }

    // we didn't find it, it's new, so create and store it in the customization list
    if (!found_sensor) {
        EMSESP::webCustomizationService.update([&](WebCustomization & settings) {
            auto newSensor   = AnalogCustomization();
            newSensor.gpio   = gpio;
            newSensor.name   = name;
            newSensor.offset = offset;
            newSensor.factor = factor;
            newSensor.uom    = uom;
            newSensor.type   = type;
            settings.analogCustomizations.push_back(newSensor);
            LOG_DEBUG("Adding new customization for analog sensor GPIO %02d", gpio);
            return StateUpdateResult::CHANGED; // persist the change
        });
    }

    // reloads the sensors in the customizations file into the sensors list
    reload();

    // return false if it's an invalid GPIO, an error will show in WebUI
    // and reported as an error in the log
    return System::is_valid_gpio(gpio);
}

// check to see if values have been updated
bool AnalogSensor::updated_values() {
    return std::exchange(changed_, false);
}

// publish a single sensor to MQTT
void AnalogSensor::publish_sensor(const Sensor & sensor) const {
    const auto   sensor_type = sensor.type();
    const char * sensor_name = sensor.name().c_str();

    if (Mqtt::publish_single()) {
        char topic[Mqtt::MQTT_TOPIC_MAX_SIZE];
        if (Mqtt::publish_single2cmd()) {
            snprintf(topic, sizeof(topic), "%s/%s", F_(analogsensor), sensor_name);
        } else {
            snprintf(topic, sizeof(topic), "%s_data/%s", F_(analogsensor), sensor_name);
        }
        char result[12];
        if (sensor_type == AnalogType::DIGITAL_IN || sensor_type == AnalogType::DIGITAL_OUT) {
            Helpers::render_boolean(result, sensor.value() != 0);
        } else {
            Helpers::render_value(result, sensor.value(), 2);
        }
        Mqtt::queue_publish(topic, result);
    }
    char cmd[COMMAND_MAX_LENGTH];
    snprintf(cmd, sizeof(cmd), "%s/%s", F_(analogsensor), sensor_name);
    EMSESP::webSchedulerService.onChange(cmd);
}

// send empty config topic to remove the entry from HA
void AnalogSensor::remove_ha_topic(const int8_t type, const uint8_t gpio) const {
    if (!Mqtt::ha_enabled()) {
        return;
    }

    LOG_DEBUG("Removing HA config for analog sensor GPIO %02d", gpio);
    char topic[Mqtt::MQTT_TOPIC_MAX_SIZE];

#if CONFIG_IDF_TARGET_ESP32
    if (type == AnalogType::DIGITAL_OUT && gpio != 25 && gpio != 26) {
#else
    if (type == AnalogType::DIGITAL_OUT) {
#endif
        snprintf(topic, sizeof(topic), "switch/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    } else if (type == AnalogType::DIGITAL_OUT) { // DAC
        snprintf(topic, sizeof(topic), "number/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    } else if (type >= AnalogType::PWM_0 && type <= AnalogType::PWM_2) {
        snprintf(topic, sizeof(topic), "number/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    } else if (type >= AnalogType::RGB) {
        snprintf(topic, sizeof(topic), "number/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    } else if (type == AnalogType::DIGITAL_IN) {
        snprintf(topic, sizeof(topic), "binary_sensor/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    } else {
        snprintf(topic, sizeof(topic), "sensor/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    }
    Mqtt::queue_remove_topic(topic);
}

// send all sensor values as a JSON package to MQTT
void AnalogSensor::publish_values(const bool force) {
    if (sensors_.empty()) {
        return;
    }

    const bool force_publish_single = force && Mqtt::publish_single();

    JsonDocument doc;
    bool         is_ha_device_created = false; // Track HA device creation

