proddy/EMS-ESP32/src/core/analogsensor.cpp
    for (auto & sensor : sensors_) {
        const auto sensor_type = sensor.type();
        if (sensor_type != AnalogType::NOTUSED) {
            // Publish single sensor if requested
            if (force_publish_single) {
                publish_sensor(sensor);
            }
            if (Mqtt::is_nested()) {
                char       s[10];
                JsonObject dataSensor = doc[Helpers::smallitoa(s, sensor.gpio())].to<JsonObject>();
                dataSensor["name"]    = sensor.name();
                switch (sensor.type()) {
                case AnalogType::COUNTER:
                case AnalogType::TIMER:
                case AnalogType::RATE:
                case AnalogType::ADC:
                case AnalogType::PWM_0:
                case AnalogType::PWM_1:
                case AnalogType::PWM_2:
                case AnalogType::FREQ_0:
                case AnalogType::FREQ_1:
                case AnalogType::FREQ_2:
                case AnalogType::RGB:
                case AnalogType::NTC:
                    dataSensor["value"] = serialized(Helpers::render_value(s, sensor.value(), 2)); // double
                    break;
                case AnalogType::DIGITAL_IN:
                case AnalogType::DIGITAL_OUT:
                    if (EMSESP::system_.bool_format() == BOOL_FORMAT_TRUEFALSE) {
                        dataSensor["value"] = sensor.value() != 0;
                    } else if (EMSESP::system_.bool_format() == BOOL_FORMAT_10) {
                        dataSensor["value"] = sensor.value() != 0 ? 1 : 0;
                    } else {
                        char result[12];
                        dataSensor["value"] = Helpers::render_boolean(result, sensor.value() != 0);
                    }
                    break;
                default:
                    break;
                }
            } else if (sensor.type() == AnalogType::DIGITAL_IN || sensor.type() == AnalogType::DIGITAL_OUT) {
                if (EMSESP::system_.bool_format() == BOOL_FORMAT_TRUEFALSE) {
                    doc[sensor.name()] = sensor.value() != 0;
                } else if (EMSESP::system_.bool_format() == BOOL_FORMAT_10) {
                    doc[sensor.name()] = sensor.value() != 0 ? 1 : 0;
                } else {
                    char result[12];
                    doc[sensor.name()] = Helpers::render_boolean(result, sensor.value() != 0);
                }
            } else {
                char s[10];
                doc[sensor.name()] = serialized(Helpers::render_value(s, sensor.value(), 2));
            }

            // create HA config if hasn't already been done
            if (Mqtt::ha_enabled() && (!sensor.ha_registered || force)) {
                LOG_DEBUG("Recreating HA config for analog sensor GPIO %02d", sensor.gpio());

                JsonDocument config;

                char stat_t[50];
                snprintf(stat_t, sizeof(stat_t), "%s/%s_data", Mqtt::base().c_str(), F_(analogsensor)); // use base path
                config["stat_t"] = stat_t;

                char val_obj[50];
                char val_cond[95];
                if (Mqtt::is_nested()) {
                    snprintf(val_obj, sizeof(val_obj), "value_json['%02d']['value']", sensor.gpio());
                    snprintf(val_cond, sizeof(val_cond), "value_json['%02d'] is defined and %s is defined", sensor.gpio(), val_obj);
                } else {
                    snprintf(val_obj, sizeof(val_obj), "value_json['%s']", sensor.name().c_str());
                    snprintf(val_cond, sizeof(val_cond), "%s is defined", val_obj);
                }
                char sample_val[12] = "0";
                if (sensor.type() == AnalogType::DIGITAL_IN || sensor.type() == AnalogType::DIGITAL_OUT) {
                    Helpers::render_boolean(sample_val, false);
                }
                // don't bother with value template conditions if using Domoticz which doesn't fully support MQTT Discovery
                if (Mqtt::discovery_type() == Mqtt::discoveryType::HOMEASSISTANT) {
                    config["val_tpl"] = (std::string) "{{" + val_obj + " if " + val_cond + "}}";
                } else {
                    config["val_tpl"] = (std::string) "{{" + val_obj + "}}";
                }

                char uniq_s[70];
                if (Mqtt::entity_format() == Mqtt::entityFormat::MULTI_SHORT) {
                    snprintf(uniq_s, sizeof(uniq_s), "%s_%s_%02d", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                } else {
                    snprintf(uniq_s, sizeof(uniq_s), "%s_%02d", F_(analogsensor), sensor.gpio());
                }

                config["uniq_id"] = uniq_s;

                char name[50];
                snprintf(name, sizeof(name), "%s", sensor.name().c_str());
                config["name"] = name;

                if (sensor.uom() != DeviceValueUOM::NONE) {
                    config["unit_of_meas"] = EMSdevice::uom_to_string(sensor.uom());
                }

                char topic[Mqtt::MQTT_TOPIC_MAX_SIZE];

                // Set commands for some analog types
                char command_topic[Mqtt::MQTT_TOPIC_MAX_SIZE];
#if CONFIG_IDF_TARGET_ESP32
                if (sensor.type() == AnalogType::DIGITAL_OUT && sensor.gpio() != 25 && sensor.gpio() != 26) {
#else
                if (sensor.type() == AnalogType::DIGITAL_OUT) {
#endif
                    snprintf(topic, sizeof(topic), "switch/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    snprintf(command_topic, sizeof(command_topic), "%s/%s/%s", Mqtt::base().c_str(), F_(analogsensor), sensor.name().c_str());
                    config["cmd_t"] = command_topic;
                    Mqtt::add_ha_bool(config.as<JsonObject>());
                } else if (sensor.type() == AnalogType::DIGITAL_OUT) { // DAC
                    snprintf(topic, sizeof(topic), "number/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    snprintf(command_topic, sizeof(command_topic), "%s/%s/%s", Mqtt::base().c_str(), F_(analogsensor), sensor.name().c_str());
                    config["cmd_t"] = command_topic;
                    config["min"]   = 0;
                    config["max"]   = 255;
                    config["mode"]  = "box"; // auto, slider or box
                    config["step"]  = 1;
                } else if (sensor.type() >= AnalogType::PWM_0 && sensor.type() <= AnalogType::PWM_2) {
                    snprintf(topic, sizeof(topic), "number/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    snprintf(command_topic, sizeof(command_topic), "%s/%s/%s", Mqtt::base().c_str(), F_(analogsensor), sensor.name().c_str());
                    config["cmd_t"] = command_topic;
                    config["min"]   = 0;
                    config["max"]   = 100;
                    config["mode"]  = "box"; // auto, slider or box
                    config["step"]  = 0.1;
                } else if (sensor.type() == AnalogType::RGB) {
                    snprintf(topic, sizeof(topic), "number/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    snprintf(command_topic, sizeof(command_topic), "%s/%s/%s", Mqtt::base().c_str(), F_(analogsensor), sensor.name().c_str());
                    config["cmd_t"] = command_topic;
                    config["min"]   = 0;
                    config["max"]   = 999999;
                    config["mode"]  = "box"; // auto, slider or box
                    config["step"]  = 1;
                } else if (sensor.type() == AnalogType::COUNTER) {
                    snprintf(topic, sizeof(topic), "sensor/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    snprintf(command_topic, sizeof(command_topic), "%s/%s/%s", Mqtt::base().c_str(), F_(analogsensor), sensor.name().c_str());
                    config["cmd_t"]    = command_topic;
                    config["stat_cla"] = "total_increasing";
                    // config["mode"]  = "box"; // auto, slider or box
                    // config["step"]  = sensor.factor();
                } else if (sensor.type() == AnalogType::DIGITAL_IN) {
                    snprintf(topic, sizeof(topic), "binary_sensor/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    Mqtt::add_ha_bool(config.as<JsonObject>());
                } else {
                    snprintf(topic, sizeof(topic), "sensor/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    config["stat_cla"] = "measurement";
                }

                // add default_entity_id
                std::string topic_str(topic);
                doc["def_ent_id"] = topic_str.substr(0, topic_str.find("/")) + "." + uniq_s;

                Mqtt::add_ha_dev_section(config.as<JsonObject>(), "Analog Sensors", nullptr, nullptr, nullptr, false);
                Mqtt::add_ha_avail_section(config.as<JsonObject>(), stat_t, !is_ha_device_created, val_cond);

                sensor.ha_registered = Mqtt::queue_ha(topic, config.as<JsonObject>());
            }

            // Track if any HA device has been registered
            if (sensor.ha_registered) {
                is_ha_device_created = true;
            }
        }
    }

    char topic[Mqtt::MQTT_TOPIC_MAX_SIZE];
    snprintf(topic, sizeof(topic), "%s_data", F_(analogsensor));
    Mqtt::queue_publish(topic, doc.as<JsonObject>());
}

// called from emsesp.cpp for commands
// searches sensor by name
bool AnalogSensor::get_value_info(JsonObject output, const char * cmd, const int8_t id) {
    if (sensors_.empty()) {
        return true; // no sensors, return true
    }

    // return all values if its an info and values command
    if (!strcmp(cmd, F_(info)) || !strcmp(cmd, F_(values))) {
        for (const auto & sensor : sensors_) {
            output[sensor.name().c_str()] = sensor.value();
        }
        return true;
    }

