proddy/EMS-ESP32/src/core/analogsensor.cpp
    // show all entity details of the command is entities
    if (!strcmp(cmd, F_(entities))) {
        for (const auto & sensor : sensors_) {
            get_value_json(output[sensor.name().c_str()].to<JsonObject>(), sensor);
        }
        return true;
    }

    // this is for a specific sensor, return the value
    const char * attribute_s = Command::get_attribute(cmd);
    const int    gpio_search = Helpers::atoint(cmd); // Cache the GPIO search value

    for (const auto & sensor : sensors_) {
        // match custom name or sensor GPIO
        if (gpio_search == sensor.gpio() || cmd == Helpers::toLower(sensor.name())) {
            get_value_json(output, sensor);
            return Command::get_attribute(output, cmd, attribute_s);
        }
    }

    return false; // not found
}

// note we don't add the device and state classes here, as we do in the custom entity service
void AnalogSensor::get_value_json(JsonObject output, const Sensor & sensor) {
    const auto sensor_type = sensor.type();

    output["name"]     = sensor.name();
    output["fullname"] = sensor.name();
    output["gpio"]     = sensor.gpio();
    output["type"]     = F_(number);
    output["analog"]   = FL_(list_sensortype)[sensor_type];
    output["value"]    = sensor.value();
    output["readable"] = true;
    output["writeable"] = sensor_type == AnalogType::COUNTER || sensor_type == AnalogType::RGB || sensor_type == AnalogType::PULSE
                          || (sensor_type >= AnalogType::DIGITAL_OUT && sensor_type <= AnalogType::PWM_2);
    output["visible"] = true;

    switch (sensor_type) {
        case AnalogType::COUNTER:
            output["min"]         = 0;
            output["max"]         = 4000000;
            output["start_value"] = sensor.offset();
            output["factor"]      = sensor.factor();
            output["uom"]         = EMSdevice::uom_to_string(sensor.uom());
            break;

        case AnalogType::ADC:
            output["offset"] = sensor.offset();
            output["factor"] = sensor.factor();
            output["uom"]    = EMSdevice::uom_to_string(sensor.uom());
            break;

        case AnalogType::TIMER:
        case AnalogType::RATE:
            output["factor"] = sensor.factor();
            break;

        case AnalogType::PWM_0:
        case AnalogType::PWM_1:
        case AnalogType::PWM_2:
            output["frequency"] = sensor.factor();
            output["min"]       = 0;
            output["max"]       = 100;
            output["uom"]       = EMSdevice::uom_to_string(sensor.uom());
            break;

        case AnalogType::DIGITAL_OUT: {
            output["min"] = 0;
#if CONFIG_IDF_TARGET_ESP32
            const uint8_t gpio = sensor.gpio();
            output["max"] = (gpio == 25 || gpio == 26) ? 255 : 1;
#elif CONFIG_IDF_TARGET_ESP32S2
            const uint8_t gpio = sensor.gpio();
            output["max"] = (gpio == 17 || gpio == 18) ? 255 : 1;
#else
            output["max"] = 1;
#endif
            static constexpr const char * state[] = {"?", "0", "1"};
            const uint8_t uom_idx = (sensor.uom() < 3) ? sensor.uom() : 0;
            output["start"] = state[uom_idx];
            break;
        }

        default:
            break;
    }
}

// this creates the sensor, initializing everything
AnalogSensor::Sensor::Sensor(const uint8_t gpio, const std::string & name, const double offset, const double factor, const uint8_t uom, const int8_t type)
    : gpio_(gpio)
    , name_(name)
    , offset_(offset)
    , factor_(factor)
    , uom_(uom)
    , type_(type) {
    value_ = 0; // init value to 0 always
}

// set the dig_out/counter/DAC/PWM value, id is gpio-no
bool AnalogSensor::command_setvalue(const char * value, const int8_t gpio) {
    float val;
    if (!Helpers::value2float(value, val)) {
        bool b;
        if (!Helpers::value2bool(value, b)) {
            return false;
        }
        val = b ? 1.0f : 0.0f;
    }

    // Find the sensor by GPIO
    auto sensor_it = std::find_if(sensors_.begin(), sensors_.end(), [gpio](const Sensor & s) { return s.gpio() == gpio; });
    if (sensor_it == sensors_.end()) {
        return false; // sensor not found
    }

    auto &       sensor    = *sensor_it;
    const double oldoffset = sensor.offset();
    const auto   type      = sensor.type();

    switch (type) {
        case AnalogType::COUNTER:
            if (val < 0 || value[0] == '+') { // sign corrects values
                sensor.set_value(sensor.value() + val);
            } else { // positive values are set
                sensor.set_value(val);
            }
            sensor.set_offset(sensor.value());
            if (sensor.value() != EMSESP::nvs_.getDouble(sensor.name().c_str(), 0)) {
                EMSESP::nvs_.putDouble(sensor.name().c_str(), sensor.value());
            }
            break;

        case AnalogType::ADC:
            sensor.set_offset(val);
            break;

        case AnalogType::RGB: {
            const uint32_t v = static_cast<uint32_t>(val);
            sensor.set_offset(v);
            sensor.set_value(v);
            const uint8_t r = v / 10000;
            const uint8_t g = (v - r * 10000) / 100;
            const uint8_t b = v % 100;
#if ESP_ARDUINO_VERSION_MAJOR < 3
            neopixelWrite(sensor.gpio(), 2 * r, 2 * g, 2 * b);
#else
            rgbLedWrite(sensor.gpio(), 2 * r, 2 * g, 2 * b);
#endif
            LOG_DEBUG("RGB set to %d, %d, %d", r, g, b);
            break;
        }

        case AnalogType::PULSE: {
            const uint8_t v = static_cast<uint8_t>(val);
            sensor.set_value(v);
            pinMode(sensor.gpio(), OUTPUT);
            digitalWrite(sensor.gpio(), (sensor.offset() != 0) ^ (sensor.value() != 0));
            sensor.polltime_ = sensor.value() != 0 ? uuid::get_uptime() + (sensor.factor() * 1000) : 0;
            break;
        }

        case AnalogType::DIGITAL_OUT: {
            const uint8_t v    = static_cast<uint8_t>(val);
            const uint8_t gpio = sensor.gpio();
#if CONFIG_IDF_TARGET_ESP32
            const bool is_dac_pin = (gpio == 25 || gpio == 26);
#elif CONFIG_IDF_TARGET_ESP32S2
            const bool is_dac_pin = (gpio == 17 || gpio == 18);
#else
            const bool is_dac_pin = false;
#endif
            if (is_dac_pin && v <= 255) {
                sensor.set_offset(v);
                sensor.set_value(v);
                pinMode(gpio, OUTPUT);
                dacWrite(gpio, v);
            } else if (v == 0 || v == 1) {
                sensor.set_offset(v);
                sensor.set_value(v);
                pinMode(gpio, OUTPUT);
                digitalWrite(gpio, (v == 0) ^ (sensor.factor() > 0));
                if (sensor.uom() == 0 && EMSESP::nvs_.getChar(sensor.name().c_str()) != static_cast<int8_t>(v)) {
                    EMSESP::nvs_.putChar(sensor.name().c_str(), static_cast<int8_t>(v));
                }
            }
            break;
        }

        case AnalogType::PWM_0:
        case AnalogType::PWM_1:
        case AnalogType::PWM_2: {
            // Clamp value to 0-100 range
            const float clamped_val = (val > 100.0f) ? 100.0f : (val < 0.0f) ? 0.0f : val;
            sensor.set_offset(clamped_val);
            sensor.set_value(clamped_val);
#if ESP_IDF_VERSION_MAJOR >= 5
            ledcWrite(sensor.gpio(), static_cast<uint32_t>(clamped_val * 8191 / 100));
#else
            const uint8_t channel = type - AnalogType::PWM_0;
            ledcWrite(channel, static_cast<uint32_t>(clamped_val * 8191 / 100));
#endif
            break;
        }

        default:
            return false;
    }

    // Publish if offset changed
    if (oldoffset != sensor.offset()) {
        publish_sensor(sensor);
        changed_ = true;
    }

    return true;
}

} // namespace emsesp